GD32-MCU-IOT/gd32_rt-thread/bsp/gd32/arm/libraries/gd32_drivers/drv_hard_i2c.c
#if !defined(SOC_SERIES_GD32H75E) && !defined(SOC_SERIES_GD32E51x) && !defined(SOC_SERIES_GD32F3x0) \
 && !defined(SOC_SERIES_GD32F50x) && !defined(SOC_SERIES_GD32G5x3) && !defined(SOC_SERIES_GD32C11x) \
 && !defined(SOC_SERIES_GD32L23x) && !defined(SOC_SERIES_GD32E23x) && !defined(SOC_SERIES_GD32E11x) \
 && !defined(SOC_SERIES_GD32H77x) && !defined(SOC_SERIES_GD32M53x) && !defined(SOC_SERIES_GD32H7xx) \
 && !defined(SOC_SERIES_GD32F5xx) && !defined(SOC_SERIES_GD32F30x)
static const struct gd32_i2c_bus gd_i2c_config[] = {
#ifdef BSP_USING_HARD_I2C0
    {
    I2C0,    /* uart peripheral index */

    RCU_I2C0, RCU_GPIOB, RCU_GPIOB,    /* periph clock, scl gpio clock, sda gpio clock */
#if defined (SOC_SERIES_GD32F30x)
        GPIOB, GPIO_MODE_AF_OD, GPIO_PIN_6,            /* scl port, scl alternate, scl pin */
        GPIOB, GPIO_MODE_AF_OD, GPIO_PIN_7,           /* sda port, sda alternate, sda pin */
#else
        GPIOB, GPIO_AF_4, GPIO_PIN_6,             /* scl port, scl alternate, scl pin */
        GPIOB, GPIO_AF_4, GPIO_PIN_7,            /* sda port, sda alternate, sda pin */
#endif
        &i2c0,
        "hwi2c0",
    },
#endif

#ifdef BSP_USING_HARD_I2C1
    {
    I2C1,    /* uart peripheral index */
#if defined (SOC_SERIES_GD32F30x)
        RCU_I2C1, RCU_GPIOB, RCU_GPIOB,       /* periph clock, scl gpio clock, sda gpio clock */

        GPIOB, GPIO_MODE_AF_OD, GPIO_PIN_10,           /* scl port, scl alternate, scl pin */
        GPIOB, GPIO_MODE_AF_OD, GPIO_PIN_11,          /* sda port, sda alternate, sda pin */
#else
        RCU_I2C1, RCU_GPIOH, RCU_GPIOB,       /* periph clock, scl gpio clock, sda gpio clock */

        GPIOH, GPIO_AF_4, GPIO_PIN_4,          /* scl port, scl alternate, scl pin */
        GPIOB, GPIO_AF_4, GPIO_PIN_11,          /* sda port, sda alternate, sda pin */
#endif

        &i2c1,
        "hwi2c1",
    },
#endif

#ifdef BSP_USING_HARD_I2C2
    {
    I2C2,    /* uart peripheral index */

    RCU_I2C2, RCU_GPIOA, RCU_GPIOC,    /* periph clock, scl gpio clock, sda gpio clock */

    GPIOA, GPIO_AF_4, GPIO_PIN_8,    /* scl port, scl alternate, scl pin */
    GPIOC, GPIO_AF_4, GPIO_PIN_9,    /* sda port, sda alternate, sda pin */

        &i2c2,
        "hwi2c2",
    },
#endif

#ifdef BSP_USING_HARD_I2C3
    {
    I2C3,    /* uart peripheral index */

    RCU_I2C3, RCU_GPIOF, RCU_GPIOF,    /* periph clock, scl gpio clock, sda gpio clock */

    GPIOF, GPIO_AF_4, GPIO_PIN_14,    /* scl port, scl alternate, scl pin */
    GPIOF, GPIO_AF_4, GPIO_PIN_15,    /* sda port, sda alternate, sda pin */

        &i2c3,
        "hwi2c3",
    },
#endif
#ifdef BSP_USING_HARD_I2C4
    {
    I2C4,    /* uart peripheral index */

    RCU_I2C4, RCU_GPIOG, RCU_GPIOG,    /* periph clock, scl gpio clock, sda gpio clock */

    GPIOG, GPIO_AF_6, GPIO_PIN_7,    /* scl port, scl alternate, scl pin */
    GPIOG, GPIO_AF_6, GPIO_PIN_8,    /* sda port, sda alternate, sda pin */

        &i2c4,
        "hwi2c4",
    },
#endif
#ifdef BSP_USING_HARD_I2C5
    {
    I2C5,    /* uart peripheral index */

    RCU_I2C5, RCU_GPIOF, RCU_GPIOF,    /* periph clock, scl gpio clock, sda gpio clock */

    GPIOF, GPIO_AF_4, GPIO_PIN_11,    /* scl port, scl alternate, scl pin */
    GPIOF, GPIO_AF_4, GPIO_PIN_12,    /* sda port, sda alternate, sda pin */

        &i2c5,
        "hwi2c5",
    }
#endif
};
#else
static const struct gd32_i2c_bus gd_i2c_config[] = {
#ifdef BSP_USING_HARD_I2C0
    {
    /* uart peripheral index */
#if defined(SOC_SERIES_GD32M53x)
    I2C,
    RCU_I2C,
    I2C_EV_IRQn,
    I2C_ER_IRQn,
#else
    I2C0,
    RCU_I2C0,
#if defined(SOC_SERIES_GD32G5x3)
    I2C0_EV_WKUP_IRQn,
#else
    I2C0_EV_IRQn,
#endif
    I2C0_ER_IRQn,
#endif
    "hwi2c0",
    &i2c0,
#ifdef BSP_USING_I2C_TX_DMA
#ifdef BSP_I2C0_TX_USING_DMA
    &i2c0_dma_tx_cfg,
#else
    RT_NULL,
#endif
#endif
#ifdef BSP_USING_I2C_RX_DMA
#ifdef BSP_I2C0_RX_USING_DMA
    &i2c0_dma_rx_cfg,
#else
    RT_NULL,
#endif
#endif
    },
#endif

#ifdef BSP_USING_HARD_I2C1
    {
    I2C1,
    RCU_I2C1,
#if defined(SOC_SERIES_GD32G5x3)
    I2C1_EV_WKUP_IRQn,
#else
    I2C1_EV_IRQn,
#endif
    I2C1_ER_IRQn,
    "hwi2c1",
    &i2c1,
#ifdef BSP_USING_I2C_TX_DMA
#ifdef BSP_I2C1_TX_USING_DMA
    &i2c1_dma_tx_cfg,
#else
    RT_NULL,
#endif
#endif
#ifdef BSP_USING_I2C_RX_DMA
#ifdef BSP_I2C1_RX_USING_DMA
    &i2c1_dma_rx_cfg,
#else
    RT_NULL,
#endif
#endif
    },
#endif

#ifdef BSP_USING_HARD_I2C2
    {
    I2C2,
    RCU_I2C2,
#if defined(SOC_SERIES_GD32G5x3)
    I2C2_EV_WKUP_IRQn,
#else
    I2C2_EV_IRQn,
#endif
    I2C2_ER_IRQn,
    "hwi2c2",
    &i2c2,
#ifdef BSP_USING_I2C_TX_DMA
#ifdef BSP_I2C2_TX_USING_DMA
    &i2c2_dma_tx_cfg,
#else
    RT_NULL,
#endif
#endif
#ifdef BSP_USING_I2C_RX_DMA
#ifdef BSP_I2C2_RX_USING_DMA
    &i2c2_dma_rx_cfg,
#else
    RT_NULL,
#endif
#endif
    },
#endif

#ifdef BSP_USING_HARD_I2C3
    {
    I2C3,
    RCU_I2C3,
#if defined(SOC_SERIES_GD32G5x3)
    I2C3_EV_WKUP_IRQn,
#else
    I2C3_EV_IRQn,
#endif
    I2C3_ER_IRQn,
    "hwi2c3",
    &i2c3,
#ifdef BSP_USING_I2C_TX_DMA
#ifdef BSP_I2C3_TX_USING_DMA
    &i2c3_dma_tx_cfg,
#else
    RT_NULL,
#endif
#endif
#ifdef BSP_USING_I2C_RX_DMA
#ifdef BSP_I2C3_RX_USING_DMA
    &i2c3_dma_rx_cfg,
#else
    RT_NULL,
#endif
#endif
    },
#endif

#ifdef BSP_USING_HARD_I2C4
    {
    I2C4,
    RCU_I2C4,
    I2C4_EV_IRQn,
    I2C4_ER_IRQn,
    "hwi2c4",
    &i2c4,
#ifdef BSP_USING_I2C_TX_DMA
#ifdef BSP_I2C4_TX_USING_DMA
    &i2c4_dma_tx_cfg,
#else
    RT_NULL,
#endif
#endif
#ifdef BSP_USING_I2C_RX_DMA
#ifdef BSP_I2C4_RX_USING_DMA
    &i2c4_dma_rx_cfg,
#else
    RT_NULL,
#endif
#endif
    },
#endif

#ifdef BSP_USING_HARD_I2C5
    {
    I2C5,
    RCU_I2C5,
    I2C5_EV_IRQn,
    I2C5_ER_IRQn,
    "hwi2c5",
    &i2c5,
#ifdef BSP_USING_I2C_TX_DMA
#ifdef BSP_I2C5_TX_USING_DMA
    &i2c5_dma_tx_cfg,
#else
    RT_NULL,
#endif
#endif
#ifdef BSP_USING_I2C_RX_DMA
#ifdef BSP_I2C5_RX_USING_DMA
    &i2c5_dma_rx_cfg,
#else
    RT_NULL,
#endif
#endif
    }
#endif
};
#endif

/**
 * @brief  Unified timeout wait for I2C/DMA flag or legacy control bit.
  * @param  periph      I2C peripheral (used for I2C flag check)
  * @param  flag        Flag or legacy control bit to wait for
  * @param  set         RT_TRUE = wait for flag SET, RT_FALSE = wait for flag RESET
  * @param  dma         DMA config pointer (RT_NULL for I2C, non-NULL for DMA)
  * @retval RT_EOK on success, -RT_ETIMEOUT on timeout
  */
static int gd32_timeout_wait_flag(uint32_t periph, uint32_t flag, rt_bool_t set, struct dma_config *dma)
{
    rt_tick_t timeout = rt_tick_from_millisecond(I2C_DMA_TIMEOUT_MS);
    rt_tick_t start = rt_tick_get();

    while(1)
    {
        FlagStatus status;

