GD32-MCU-IOT/gd32_rt-thread/bsp/gd32/arm/libraries/gd32_drivers/drv_hard_i2c.c
#if defined(BSP_USING_I2C_RX_DMA) || defined(BSP_USING_I2C_TX_DMA)
        if(dma != RT_NULL)
        {
            /* DMA flag check */
            status = dma_flag_get(dma->periph, dma->channel, flag);
        }
        else
#endif
        {
#ifdef GD32_I2C_HAS_LEGACY_IP
            if(IS_I2C_LEGACY(periph))
            {
                if(flag == I2C_CTL0_STOP)
                {
                    /* Legacy STOP is a control bit in CTL0, not a status flag. */
                    status = (I2C_CTL0(periph) & I2C_CTL0_STOP) ? SET : RESET;
                }
                else
                {
                    /* Legacy I2C flag check */
                    status = i2c_flag_get(periph, flag);
                }
            }
            else
#endif
            {
                /* New I2C flag check */
                status = i2c_flag_get_gd(periph, flag);
            }
        }

        if((set && status == SET) || (!set && status != SET))
        {
            return RT_EOK;
        }

        if(rt_tick_get() - start > timeout)
        {
            return -RT_ETIMEOUT;
        }

        rt_thread_mdelay(1);
    }
}

#if defined(BSP_USING_I2C_RX_DMA) || defined(BSP_USING_I2C_TX_DMA)
/**
  * @brief  configure DMA channel for I2C transfer.
  * @param  dma
  * @param  periph_addr
  * @param  buf
  * @param  len
  * @param  direction
  * @retval None
  */
static void gd32_i2c_dma_config_channel(struct dma_config *dma, uint32_t periph_addr, uint8_t *buf, uint16_t len, uint32_t direction)
{
    dma_single_data_parameter_struct dma_init_struct;

    rcu_periph_clock_enable(dma->rcu);
    dma_deinit(dma->periph, dma->channel);
    dma_single_data_para_struct_init(&dma_init_struct);
    dma_init_struct.periph_addr = periph_addr;
    dma_init_struct.memory0_addr = (uint32_t)buf;
    dma_init_struct.direction = direction;
    dma_init_struct.number = len;
    dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
    dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
    dma_init_struct.periph_memory_width = dma->data_width;
    dma_init_struct.priority = DMA_PRIORITY_ULTRA_HIGH;
    dma_single_data_mode_init(dma->periph, dma->channel, &dma_init_struct);
    dma_channel_subperipheral_select(dma->periph, dma->channel, dma->subperiph);
    dma_circulation_disable(dma->periph, dma->channel);
    /* NOTE: Do NOT enable DMA channel here! Caller controls enable order. */
}

#ifdef GD32_I2C_HAS_NEW_IP
/**
  * @brief  calculate frame mode for new I2C DMA transfer.
  * @param  msg
  * @param  next_msg
  * @param  index
  * @param  num
  * @retval frame mode constant
  */
static uint32_t gd32_i2c_new_frame_mode(struct rt_i2c_msg *msg, struct rt_i2c_msg *next_msg, rt_uint32_t index, rt_uint32_t num)
{
    uint8_t next_has_no_start = (next_msg != RT_NULL) && (next_msg->flags & RT_I2C_NO_START);

    if(num == 1)
    {
        /* Single message */
        return (msg->flags & RT_I2C_NO_STOP) ? GD32_I2C_LAST_FRAME_NO_STOP : GD32_I2C_FIRST_AND_LAST_FRAME;
    }
    else if(index == 0)
    {
        /* First message of multiple */
        if(next_has_no_start)
            return GD32_I2C_FIRST_FRAME_RELOAD;  /* Use RELOAD for seamless continuation */
        else
            return GD32_I2C_FIRST_FRAME;
    }
    else if(index == num - 1)
    {
        /* Last message */
        return (msg->flags & RT_I2C_NO_STOP) ? GD32_I2C_LAST_FRAME_NO_STOP : GD32_I2C_LAST_FRAME;
    }
    else
    {
        /* Middle message */
        if(next_has_no_start)
            return GD32_I2C_NEXT_FRAME_RELOAD;  /* RESTART, then RELOAD for seamless continuation */
        else
            return GD32_I2C_NEXT_FRAME;
    }
}
#endif /* GD32_I2C_HAS_NEW_IP */
#endif

#ifdef GD32_I2C_HAS_NEW_IP
#if defined(BSP_USING_I2C_TX_DMA) || defined(BSP_USING_I2C_RX_DMA)
/**
    * @brief  new I2C single-message transfer (DMA or polling).
    * @param  i2c_bus
    * @param  msg
    * @param  mode
    * @param  is_read
    * @param  use_dma
    * @retval 0 on success, non-zero on error
    */
static int gd32_i2c_new_msg_xfer(const struct gd32_i2c_bus *i2c_bus, struct rt_i2c_msg *msg, uint32_t mode, uint8_t is_read, uint8_t use_dma)
{
    uint32_t i2c_periph = i2c_bus->i2c_periph;
    uint16_t shifted_addr = msg->addr << 1;
    uint16_t remaining = msg->len;
    uint8_t *p_current = msg->buf;
    uint32_t nbytes;

    /* Direction-specific parameters */
    uint32_t i2c_direction = is_read ? I2C_MASTER_RECEIVE_GD : I2C_MASTER_TRANSMIT_GD;
    const char *dir_str = is_read ? "rx" : "tx";

    struct dma_config *dma = RT_NULL;
    uint32_t data_reg = 0;
    uint32_t dma_direction = 0;
    uint32_t dma_mode = 0;

    if(use_dma)
    {
        dma = is_read ? i2c_bus->dma_rx : i2c_bus->dma_tx;
        data_reg = is_read ? (uint32_t)&I2C_RDATA_GD(i2c_periph)
                           : (uint32_t)&I2C_TDATA_GD(i2c_periph);
        dma_direction = is_read ? DMA_PERIPH_TO_MEMORY : DMA_MEMORY_TO_PERIPH;
        dma_mode = is_read ? I2C_DMA_RECEIVE_GD : I2C_DMA_TRANSMIT_GD;
    }

    /* Only first frame needs to wait for bus idle */
    uint8_t need_bus_idle_wait = (mode == GD32_I2C_FIRST_FRAME ||
                                   mode == GD32_I2C_FIRST_AND_LAST_FRAME ||
                                   mode == GD32_I2C_FIRST_FRAME_RELOAD);
    /* Send START unless NO_START flag */
    uint8_t need_start = !(msg->flags & RT_I2C_NO_START) &&
                          (mode != GD32_I2C_NEXT_FRAME_NO_START);
    uint8_t need_autoend = (mode == GD32_I2C_LAST_FRAME ||
                             mode == GD32_I2C_FIRST_AND_LAST_FRAME);
    /* Use RELOAD mode when next msg continues without START */
    uint8_t use_reload_for_next = (mode == GD32_I2C_FIRST_FRAME_RELOAD ||
                                    mode == GD32_I2C_NEXT_FRAME_RELOAD);
    /* Check if continuing from RELOAD */
    uint8_t continuing_from_reload = (msg->flags & RT_I2C_NO_START) != 0;

    /* Only configure address for new transfers, not when continuing from RELOAD */
    if(!continuing_from_reload)
    {
        i2c_master_addressing_gd(i2c_periph, shifted_addr, i2c_direction);
    }

