GD32-MCU-IOT/gd32_rt-thread/bsp/gd32/arm/libraries/gd32_drivers/drv_hard_i2c.c
    /* Wait for bus idle if starting new transfer */
    if(need_bus_idle_wait)
    {
        if(gd32_timeout_wait_flag(i2c_periph, I2C_FLAG_I2CBSY_GD, RT_FALSE, RT_NULL) != 0)
        {
            LOG_E("i2c %s bus busy timeout", dir_str);
            return -RT_ETIMEOUT;
        }
    }

    while(remaining > 0)
    {
        uint8_t is_last_chunk = (remaining <= MAX_RELOAD_SIZE);
        nbytes = is_last_chunk ? remaining : MAX_RELOAD_SIZE;

        if(use_dma)
        {
            /* Configure DMA channel */
            gd32_i2c_dma_config_channel(dma, data_reg, p_current, nbytes, dma_direction);
            i2c_dma_enable_gd(i2c_periph, dma_mode);
            dma_channel_enable(dma->periph, dma->channel);
        }

        /* Configure NBYTES + RELOAD + AUTOEND atomically */
        uint8_t set_reload = !is_last_chunk || use_reload_for_next;
        uint8_t set_autoend = is_last_chunk && need_autoend;
        i2c_nbytes_reload_autoend_config_gd(i2c_periph, nbytes, set_reload, set_autoend);

        /* Send START only for first chunk when needed */
        if(need_start && p_current == msg->buf)
        {
            i2c_start_on_bus_gd(i2c_periph);
        }

        if(use_dma)
        {
            /* Wait for DMA FTF */
            if(gd32_timeout_wait_flag(i2c_periph, DMA_FLAG_FTF, RT_TRUE, dma) != 0)
            {
                LOG_E("i2c %s dma timeout", dir_str);
                goto error_exit_dma;
            }
            dma_flag_clear(dma->periph, dma->channel, DMA_FLAG_FTF);
            dma_channel_disable(dma->periph, dma->channel);

            p_current += nbytes;
            remaining -= nbytes;
        }
        else
        {
            /* Polling data transfer */
            if(is_read)
            {
                while(nbytes > 0)
                {
                    if(gd32_timeout_wait_flag(i2c_periph, I2C_FLAG_RBNE_GD, RT_TRUE, RT_NULL) != 0)
                    {
                        LOG_E("i2c rx RBNE timeout");
                        goto error_exit;
                    }
                    *p_current++ = i2c_data_receive_gd(i2c_periph);
                    nbytes--;
                    remaining--;
                }
            }
            else
            {
                while(nbytes > 0)
                {
                    if(gd32_timeout_wait_flag(i2c_periph, I2C_FLAG_TI_GD, RT_TRUE, RT_NULL) != 0)
                    {
                        LOG_E("i2c tx TI timeout");
                        goto error_exit;
                    }
                    i2c_data_transmit_gd(i2c_periph, *p_current++);
                    nbytes--;
                    remaining--;
                }
            }
        }

        /* If more data in this msg, wait for TCR before next chunk */
        if(remaining > 0)
        {
            if(gd32_timeout_wait_flag(i2c_periph, I2C_FLAG_TCR_GD, RT_TRUE, RT_NULL) != 0)
            {
                LOG_E("i2c %s TCR timeout", dir_str);
                goto error_exit;
            }
        }
    }

    /* Wait for completion based on mode */
    if(need_autoend)
    {
        if(gd32_timeout_wait_flag(i2c_periph, I2C_FLAG_STPDET_GD, RT_TRUE, RT_NULL) != 0)
        {
            LOG_E("i2c %s STOP timeout", dir_str);
            goto error_exit;
        }
        i2c_flag_clear_gd(i2c_periph, I2C_FLAG_STPDET_GD);
    }
    else if(use_reload_for_next)
    {
        if(gd32_timeout_wait_flag(i2c_periph, I2C_FLAG_TCR_GD, RT_TRUE, RT_NULL) != 0)
        {
            LOG_E("i2c %s TCR timeout (reload)", dir_str);
            goto error_exit;
        }
    }
    else
    {
        if(gd32_timeout_wait_flag(i2c_periph, I2C_FLAG_TC_GD, RT_TRUE, RT_NULL) != 0)
        {
            LOG_E("i2c %s TC timeout", dir_str);
            goto error_exit;
        }
    }

    if(use_dma)
    {
        i2c_dma_disable_gd(i2c_periph, dma_mode);
    }
    return 0;

error_exit_dma:
    dma_channel_disable(dma->periph, dma->channel);
    i2c_dma_disable_gd(i2c_periph, dma_mode);
error_exit:
    i2c_stop_on_bus_gd(i2c_periph);
    return -RT_ETIMEOUT;
}
#endif /* BSP_USING_I2C_*_DMA */
#endif /* GD32_I2C_HAS_NEW_IP */

#ifdef GD32_I2C_HAS_LEGACY_IP
#ifdef BSP_USING_I2C_TX_DMA
/**
  * @brief  legacy I2C TX DMA transfer.
  * @param  i2c_bus
  * @param  msg
  * @retval 0 on success, non-zero on error
  */
static int gd32_i2c_legacy_dma_write(const struct gd32_i2c_bus *i2c_bus, const struct rt_i2c_msg *msg)
{
    uint32_t i2c_periph = i2c_bus->i2c_periph;
    struct dma_config *dma_tx = i2c_bus->dma_tx;
    int result;

    /* Configure DMA channel and enable I2C DMA
     * Official order: I2C DMA enable -> DMA channel enable */
    gd32_i2c_dma_config_channel(dma_tx, (uint32_t)&I2C_DATA(i2c_periph),
                                 msg->buf, msg->len, DMA_MEMORY_TO_PERIPH);
    i2c_dma_config(i2c_periph, I2C_DMA_ON);
    dma_channel_enable(dma_tx->periph, dma_tx->channel);

    /* Wait for DMA completion */
    result = gd32_timeout_wait_flag(i2c_periph, DMA_FLAG_FTF, RT_TRUE, dma_tx);
    dma_channel_disable(dma_tx->periph, dma_tx->channel);
    dma_flag_clear(dma_tx->periph, dma_tx->channel, DMA_FLAG_FTF);
    if(result != 0)
    {
        i2c_dma_config(i2c_periph, I2C_DMA_OFF);
        return result;
    }

    /* Wait for I2C BTC (Byte Transfer Complete) */
    if(gd32_timeout_wait_flag(i2c_periph, I2C_FLAG_BTC, RT_TRUE, RT_NULL) != 0)
    {
        i2c_dma_config(i2c_periph, I2C_DMA_OFF);
        return -RT_ETIMEOUT;
    }

    /* Disable I2C DMA */
    i2c_dma_config(i2c_periph, I2C_DMA_OFF);

    return 0;
}
#endif /* BSP_USING_I2C_TX_DMA */
#endif /* GD32_I2C_HAS_LEGACY_IP */

#ifdef GD32_I2C_HAS_LEGACY_IP
#ifdef BSP_USING_I2C_RX_DMA
/**
  * @brief  legacy I2C RX DMA transfer.
  * @param  i2c_bus
  * @param  msg
  * @retval 0 on success, non-zero on error
  */
static int gd32_i2c_legacy_dma_read(const struct gd32_i2c_bus *i2c_bus, const struct rt_i2c_msg *msg)
{
    uint32_t i2c_periph = i2c_bus->i2c_periph;
    struct dma_config *dma_rx = i2c_bus->dma_rx;
    int result;

