GD32-MCU-IOT/gd32_rt-thread/bsp/gd32/arm/libraries/gd32_drivers/drv_hard_i2c.c
    /* Official style: clear ADDSEND first, then configure DMA */
    i2c_flag_clear(i2c_periph, I2C_FLAG_ADDSEND);

    /* Configure DMA channel */
    gd32_i2c_dma_config_channel(dma_rx, (uint32_t)&I2C_DATA(i2c_periph),
                                 msg->buf, msg->len, DMA_PERIPH_TO_MEMORY);
    i2c_dma_last_transfer_config(i2c_periph, I2C_DMALST_ON);
    i2c_dma_config(i2c_periph, I2C_DMA_ON);
    dma_channel_enable(dma_rx->periph, dma_rx->channel);

    /* Wait for DMA completion */
    result = gd32_timeout_wait_flag(i2c_periph, DMA_FLAG_FTF, RT_TRUE, dma_rx);
    dma_channel_disable(dma_rx->periph, dma_rx->channel);
    dma_flag_clear(dma_rx->periph, dma_rx->channel, DMA_FLAG_FTF);

    /* Send STOP */
    i2c_stop_on_bus(i2c_periph);

    /* Cleanup */
    i2c_dma_last_transfer_config(i2c_periph, I2C_DMALST_OFF);
    i2c_dma_config(i2c_periph, I2C_DMA_OFF);

    return result;
}
#endif /* BSP_USING_I2C_RX_DMA */
#endif /* GD32_I2C_HAS_LEGACY_IP */


#if !defined(SOC_SERIES_GD32H75E) && !defined(SOC_SERIES_GD32E51x) && !defined(SOC_SERIES_GD32F3x0) \
 && !defined(SOC_SERIES_GD32F50x) && !defined(SOC_SERIES_GD32G5x3) && !defined(SOC_SERIES_GD32C11x) \
 && !defined(SOC_SERIES_GD32L23x) && !defined(SOC_SERIES_GD32E23x) && !defined(SOC_SERIES_GD32E11x) \
 && !defined(SOC_SERIES_GD32H77x) && !defined(SOC_SERIES_GD32M53x) && !defined(SOC_SERIES_GD32H7xx) \
 && !defined(SOC_SERIES_GD32F5xx) && !defined(SOC_SERIES_GD32F30x)
/**
  * @brief  This function initializes the i2c pin.
  * @param  i2c
  * @retval None
  */
static void gd32_i2c_gpio_init(const struct gd32_i2c_bus *i2c)
{
    /* enable I2C and GPIO clock */
    rcu_periph_clock_enable(i2c->scl_gpio_clk);
    rcu_periph_clock_enable(i2c->sda_gpio_clk);
    rcu_periph_clock_enable(i2c->i2c_clk);
#if defined (SOC_SERIES_GD32F30x)
    gpio_init(i2c->sda_port, GPIO_MODE_AF_OD, GPIO_OSPEED_50MHZ, i2c->sda_pin);
    gpio_init(i2c->scl_port, GPIO_MODE_AF_OD, GPIO_OSPEED_50MHZ, i2c->scl_pin);
#else

    /* configure I2C_SCL as alternate function push-pull */
    gpio_af_set(i2c->scl_port, i2c->scl_af, i2c->scl_pin);
    gpio_mode_set(i2c->scl_port, GPIO_MODE_AF, GPIO_PUPD_PULLUP, i2c->scl_pin);
#if defined (SOC_SERIES_GD32H7xx)
    gpio_output_options_set(i2c->scl_port, GPIO_OTYPE_OD, GPIO_OSPEED_60MHZ, i2c->scl_pin);
    /* configure I2C_SDA as alternate function push-pull */
    gpio_af_set(i2c->sda_port, i2c->sda_af, i2c->sda_pin);
    gpio_mode_set(i2c->sda_port, GPIO_MODE_AF, GPIO_PUPD_PULLUP, i2c->sda_pin);
    gpio_output_options_set(i2c->sda_port, GPIO_OTYPE_OD, GPIO_OSPEED_60MHZ, i2c->sda_pin);
#else
    gpio_output_options_set(i2c->scl_port, GPIO_OTYPE_OD, GPIO_OSPEED_50MHZ, i2c->scl_pin);
    /* configure I2C_SDA as alternate function push-pull */
    gpio_af_set(i2c->sda_port, i2c->sda_af, i2c->sda_pin);
    gpio_mode_set(i2c->sda_port, GPIO_MODE_AF, GPIO_PUPD_PULLUP, i2c->sda_pin);
    gpio_output_options_set(i2c->sda_port, GPIO_OTYPE_OD, GPIO_OSPEED_50MHZ, i2c->sda_pin);
#endif
#endif
}
#else
#warning "gd32_i2c_gpio_init should be defined in board_msd_init.c"
rt_weak void gd32_i2c_gpio_init(const struct gd32_i2c_bus *i2c)
{
}
#endif

/**
  * @brief  read data.
  * @param  i2c_periph
  * @param  *p_buffer
  * @param  data_byte
  * @retval 0 on success, -RT_ETIMEOUT on timeout
  */
static int8_t gd32_i2c_read(rt_uint32_t i2c_periph, rt_uint8_t *p_buffer, rt_uint16_t data_byte)
{
    if (data_byte == 0) return 1;
    /* while there is data to be read */

    while(data_byte)
    {
#ifdef GD32_I2C_HAS_LEGACY_IP
        if(IS_I2C_LEGACY(i2c_periph))
        {
            if(3 == data_byte)
            {
                /* wait until BTC bit is set */
                if(gd32_timeout_wait_flag(i2c_periph, I2C_FLAG_BTC, RT_TRUE, RT_NULL) != 0)
                    return -RT_ETIMEOUT;
                /* disable acknowledge */
                i2c_ack_config(i2c_periph, I2C_ACK_DISABLE);
            }

            if(2 == data_byte)
            {
                /* wait until BTC bit is set */
                if(gd32_timeout_wait_flag(i2c_periph, I2C_FLAG_BTC, RT_TRUE, RT_NULL) != 0)
                    return -RT_ETIMEOUT;
                /* send a stop condition to I2C bus */
                i2c_stop_on_bus(i2c_periph);
            }
            /* wait until RBNE bit is set */
            if(i2c_flag_get(i2c_periph, I2C_FLAG_RBNE))
            {
                    /* read a byte from the EEPROM */
                    *p_buffer = i2c_data_receive(i2c_periph);
                    /* point to the next location where the byte read will be saved */
                    p_buffer++;
                    /* decrement the read bytes counter */
                    data_byte--;
            }
        }else
#endif
        {
            /* wait until the RBNE bit is set */
            if(gd32_timeout_wait_flag(i2c_periph, I2C_FLAG_RBNE_GD, RT_TRUE, RT_NULL) != 0)
                return -RT_ETIMEOUT;

            /* read a byte */
            *p_buffer = i2c_data_receive_gd(i2c_periph);
            /* point to the next location where the byte read will be saved */
            p_buffer++;
            /* decrement the read bytes counter */
            data_byte--;
        }
    }
    return 0;
}

/**
  * @brief  write data.
  * @param  i2c_periph
  * @param  *p_buffer
  * @param  data_byte
  * @retval 0 on success, -RT_ETIMEOUT on timeout
  */
static int8_t gd32_i2c_write(rt_uint32_t i2c_periph, uint8_t *p_buffer, uint16_t data_byte)
{
    if (data_byte == 0) return 1;

    while(data_byte)
    {
#ifdef GD32_I2C_HAS_LEGACY_IP
        if(IS_I2C_LEGACY(i2c_periph))
        {
            /* data transmission */
            i2c_data_transmit(i2c_periph, *p_buffer);
            /* point to the next byte to be written */
            p_buffer++;
            /* decrement the write bytes counter */
            data_byte--;
            /* wait until BTC bit is set */
            if(gd32_timeout_wait_flag(i2c_periph, I2C_FLAG_BTC, RT_TRUE, RT_NULL) != 0)
                return -RT_ETIMEOUT;
        }
        else
#endif
        {
#ifdef GD32_I2C_HAS_NEW_IP
            /* wait until the transmit data buffer is empty */
            if(gd32_timeout_wait_flag(i2c_periph, I2C_FLAG_TBE, RT_TRUE, RT_NULL) != 0)
                return -RT_ETIMEOUT;

            while(data_byte)
            {
                /* wait until the TI bit is set */
                if(gd32_timeout_wait_flag(i2c_periph, I2C_FLAG_TI_GD, RT_TRUE, RT_NULL) != 0)
                    return -RT_ETIMEOUT;
                /* data transmission */
                i2c_data_transmit_gd(i2c_periph, *p_buffer);
                /* point to the next byte to be written */
                p_buffer++;
                /* decrement the write bytes counter */
                data_byte--;
            }
#endif
        }
    }
    return 0;
}

#ifdef GD32_I2C_HAS_LEGACY_IP
#if defined(BSP_USING_I2C_TX_DMA) || defined(BSP_USING_I2C_RX_DMA)
static rt_ssize_t gd32_i2c_legacy_dma_xfer(struct gd32_i2c_bus *gd32_i2c,
                                           struct rt_i2c_msg msgs[],
                                           rt_uint32_t num)
{
    struct rt_i2c_msg *msg = RT_NULL;
    rt_uint16_t addr;
    rt_uint32_t i;
    rt_err_t ret = RT_ERROR;

    for(i = 0; i < num; i++)
    {
        msg = &msgs[i];
        addr = msg->addr << 1;

        if(!(msg->flags & RT_I2C_NO_START))
        {
            if(msg->flags & RT_I2C_RD)
            {
                i2c_ack_config(gd32_i2c->i2c_periph, I2C_ACK_ENABLE);
                if(msg->len == 2U)
                {
                    i2c_ackpos_config(gd32_i2c->i2c_periph, I2C_ACKPOS_NEXT);
                }

                i2c_start_on_bus(gd32_i2c->i2c_periph);
                if(gd32_timeout_wait_flag(gd32_i2c->i2c_periph, I2C_FLAG_SBSEND, RT_TRUE, RT_NULL) != 0)
                {
                    ret = -RT_ERROR;
                    break;
                }

