GD32-MCU-IOT/gd32_rt-thread/bsp/gd32/arm/libraries/gd32_drivers/drv_hard_i2c.c
                i2c_master_addressing(gd32_i2c->i2c_periph, addr, I2C_RECEIVER);
                if(gd32_timeout_wait_flag(gd32_i2c->i2c_periph, I2C_FLAG_ADDSEND, RT_TRUE, RT_NULL) != 0)
                {
                    ret = -RT_ERROR;
                    break;
                }

#ifdef BSP_USING_I2C_RX_DMA
                if(!(msg->len >= I2C_DMA_TRANS_MIN_LEN && msg->len >= 2 && gd32_i2c->dma_rx != RT_NULL))
#endif
                {
                    if(msg->len <= 2)
                    {
                        i2c_ack_config(gd32_i2c->i2c_periph, I2C_ACK_DISABLE);
                    }
                    i2c_flag_clear(gd32_i2c->i2c_periph, I2C_FLAG_ADDSEND);
                    if(msg->len == 1)
                    {
                        i2c_stop_on_bus(gd32_i2c->i2c_periph);
                    }
                }
            }
            else
            {
                if(gd32_timeout_wait_flag(gd32_i2c->i2c_periph, I2C_FLAG_I2CBSY, RT_FALSE, RT_NULL) != 0)
                {
                    ret = -RT_ERROR;
                    break;
                }

                i2c_start_on_bus(gd32_i2c->i2c_periph);
                if(gd32_timeout_wait_flag(gd32_i2c->i2c_periph, I2C_FLAG_SBSEND, RT_TRUE, RT_NULL) != 0)
                {
                    ret = -RT_ERROR;
                    break;
                }

                i2c_master_addressing(gd32_i2c->i2c_periph, addr, I2C_TRANSMITTER);
                if(gd32_timeout_wait_flag(gd32_i2c->i2c_periph, I2C_FLAG_ADDSEND, RT_TRUE, RT_NULL) != 0)
                {
                    ret = -RT_ERROR;
                    break;
                }

                i2c_flag_clear(gd32_i2c->i2c_periph, I2C_FLAG_ADDSEND);
            }
        }

        if(msg->flags & RT_I2C_RD)
        {
#ifdef BSP_USING_I2C_RX_DMA
            if(msg->len >= I2C_DMA_TRANS_MIN_LEN && msg->len >= 2 && gd32_i2c->dma_rx != RT_NULL)
            {
                if(gd32_i2c_legacy_dma_read(gd32_i2c, msg) != 0)
                {
                    LOG_E("i2c bus dma read failed!");
                    ret = -RT_ERROR;
                    break;
                }
            }
            else
#endif
            {
                if(gd32_i2c_read(gd32_i2c->i2c_periph, msg->buf, msg->len) != 0)
                {
                    LOG_E("i2c bus read failed,i2c bus stop!");
                    ret = -RT_ERROR;
                    break;
                }
            }
        }
        else
        {
#ifdef BSP_USING_I2C_TX_DMA
            if(msg->len >= I2C_DMA_TRANS_MIN_LEN && gd32_i2c->dma_tx != RT_NULL)
            {
                if(gd32_i2c_legacy_dma_write(gd32_i2c, msg) != 0)
                {
                    LOG_E("i2c bus dma write failed,i2c bus stop!");
                    ret = -RT_ERROR;
                    break;
                }
            }
            else
#endif
            {
                if(gd32_i2c_write(gd32_i2c->i2c_periph, msg->buf, msg->len) != 0)
                {
                    LOG_E("i2c bus write failed,i2c bus stop!");
                    ret = -RT_ERROR;
                    break;
                }
            }
        }
    }

    if((ret == RT_ERROR) && (i == num))
    {
        ret = i;
    }

    if((msg != RT_NULL) && !(msg->flags & RT_I2C_NO_STOP))
    {
        int wait_result;

        if(msg->flags & RT_I2C_RD)
        {
            wait_result = gd32_timeout_wait_flag(gd32_i2c->i2c_periph,
                                                 I2C_CTL0_STOP,
                                                 RT_FALSE,
                                                 RT_NULL);
        }
        else
        {
            i2c_stop_on_bus(gd32_i2c->i2c_periph);
            wait_result = gd32_timeout_wait_flag(gd32_i2c->i2c_periph,
                                                 I2C_CTL0_STOP,
                                                 RT_FALSE,
                                                 RT_NULL);
        }

        if(wait_result != RT_EOK)
        {
            ret = wait_result;
        }
    }

    return ret;
}
#endif
#endif

#ifdef GD32_I2C_HAS_NEW_IP
#if defined(BSP_USING_I2C_TX_DMA) || defined(BSP_USING_I2C_RX_DMA)
static rt_ssize_t gd32_i2c_new_dma_xfer(struct gd32_i2c_bus *gd32_i2c,
                                        struct rt_i2c_msg msgs[],
                                        rt_uint32_t num)
{
    rt_uint32_t i;

    for(i = 0; i < num; i++)
    {
        struct rt_i2c_msg *msg = &msgs[i];
        struct rt_i2c_msg *next_msg = (i < num - 1) ? &msgs[i + 1] : RT_NULL;
        uint32_t frame_mode = gd32_i2c_new_frame_mode(msg, next_msg, i, num);
        uint8_t is_read = (msg->flags & RT_I2C_RD) != 0;
        struct dma_config *dma = is_read ? gd32_i2c->dma_rx : gd32_i2c->dma_tx;
        uint8_t use_dma = (msg->len >= I2C_DMA_TRANS_MIN_LEN && dma != RT_NULL);

        if(gd32_i2c_new_msg_xfer(gd32_i2c, msg, frame_mode, is_read, use_dma) != 0)
        {
            i2c_flag_clear_gd(gd32_i2c->i2c_periph, I2C_FLAG_STPDET_GD);
            return -RT_ERROR;
        }
    }

    return i;
}
#endif
#endif

/**
  * @brief
  * @param
  * @param
  * @param
  * @retval
  */

static rt_ssize_t gd32_i2c_master_xfer(struct rt_i2c_bus_device *bus, struct rt_i2c_msg msgs[], rt_uint32_t num)
{
    struct rt_i2c_msg *msg = RT_NULL;
    struct gd32_i2c_bus *gd32_i2c = (struct gd32_i2c_bus *)bus->priv;
    rt_uint16_t addr;
    rt_uint32_t i, w_total_byte=0, r_total_byte=0;
    rt_err_t ret = RT_ERROR;

    RT_ASSERT(bus != RT_NULL);

#if defined(BSP_USING_I2C_TX_DMA) || defined(BSP_USING_I2C_RX_DMA)
#ifdef GD32_I2C_HAS_LEGACY_IP
    if(IS_I2C_LEGACY(gd32_i2c->i2c_periph))
    {
        return gd32_i2c_legacy_dma_xfer(gd32_i2c, msgs, num);
    }
#endif

#ifdef GD32_I2C_HAS_NEW_IP
    return gd32_i2c_new_dma_xfer(gd32_i2c, msgs, num);
#endif
#endif

    for(i = 0; i < num; i++)
    {
        msg = &msgs[i];

        /* Calculate total bytes for New IP non-DMA path: only on first iteration */
        if(i == 0)
        {
            for(rt_uint32_t j = 0; j < num; j++)
            {
                if(msgs[j].flags & RT_I2C_RD)
                    r_total_byte += msgs[j].len;
                else
                    w_total_byte += msgs[j].len;
            }
        }

        /* Legacy IP + New IP non-DMA path */
        addr = msg->addr << 1;
        if(!(msg->flags & RT_I2C_NO_START))
        {
    #ifdef GD32_I2C_HAS_LEGACY_IP
            if(IS_I2C_LEGACY(gd32_i2c->i2c_periph))
            {
                if(msg->flags & RT_I2C_RD)
                {
                        /* enable acknowledge */
                    i2c_ack_config(gd32_i2c->i2c_periph, I2C_ACK_ENABLE);
                    if(msg->len == 2U)
                    {
                        /* Configure ACK position for 2-byte read */
                        i2c_ackpos_config(gd32_i2c->i2c_periph, I2C_ACKPOS_NEXT);
                    }
                    /* send the start signal */
                    i2c_start_on_bus(gd32_i2c->i2c_periph);
                    /* i2c master sends START signal successfully */
                    if(gd32_timeout_wait_flag(gd32_i2c->i2c_periph, I2C_FLAG_SBSEND, RT_TRUE, RT_NULL) != 0)
                    {
                        ret = -RT_ERROR;
                        break;
                    }

