GD32-MCU-IOT/gd32_rt-thread/bsp/gd32/arm/libraries/gd32_drivers/drv_hard_i2c.c
                    i2c_master_addressing(gd32_i2c->i2c_periph, addr, I2C_RECEIVER);

                    if(gd32_timeout_wait_flag(gd32_i2c->i2c_periph, I2C_FLAG_ADDSEND, RT_TRUE, RT_NULL) != 0)
                    {
                        ret = -RT_ERROR;
                        break;
                    }

                    /* Polling read: original flow */
                    /* address flag set means i2c slave sends ACK */
                    if(msg->len <= 2)
                    {
                        i2c_ack_config(gd32_i2c->i2c_periph, I2C_ACK_DISABLE);
                    }
                    i2c_flag_clear(gd32_i2c->i2c_periph, I2C_FLAG_ADDSEND);
                    if(msg->len == 1)
                    {
                        i2c_stop_on_bus(gd32_i2c->i2c_periph);
                    }

                }
                else
                {
                    /* configure slave address */
                    if(gd32_timeout_wait_flag(gd32_i2c->i2c_periph, I2C_FLAG_I2CBSY, RT_FALSE, RT_NULL) != 0)
                    {
                        ret = -RT_ERROR;
                        break;
                    }
                    //i2c_transfer_byte_number_config(gd32_i2c->i2c_periph, w_total_byte);
                    /* send a start condition to I2C bus */
                    i2c_start_on_bus(gd32_i2c->i2c_periph);
                    if(gd32_timeout_wait_flag(gd32_i2c->i2c_periph, I2C_FLAG_SBSEND, RT_TRUE, RT_NULL) != 0)
                    {
                        ret = -RT_ERROR;
                        break;
                    }

                    i2c_master_addressing(gd32_i2c->i2c_periph, addr, I2C_TRANSMITTER);
                    if(gd32_timeout_wait_flag(gd32_i2c->i2c_periph, I2C_FLAG_ADDSEND, RT_TRUE, RT_NULL) != 0)
                    {
                        ret = -RT_ERROR;
                        break;
                    }

                    i2c_flag_clear(gd32_i2c->i2c_periph, I2C_FLAG_ADDSEND);
                }
            }
            else
#endif
            {
#ifdef GD32_I2C_HAS_NEW_IP
                if(msg->flags & RT_I2C_ADDR_10BIT)
                {
                    /* enable 10-bit addressing mode in master mode */
                    i2c_address10_enable_gd(gd32_i2c->i2c_periph);
                }
                else
                {
                    /* disable 10-bit addressing mode in master mode */
                    i2c_address10_disable_gd(gd32_i2c->i2c_periph);
                }

                if(msg->flags & RT_I2C_RD)
                {
                    /* configure slave address */
                    i2c_master_addressing_gd(gd32_i2c->i2c_periph, addr, I2C_MASTER_RECEIVE_GD);

                    i2c_transfer_byte_number_config_gd(gd32_i2c->i2c_periph, r_total_byte);
                    /* send a start condition to I2C bus */
                    i2c_start_on_bus_gd(gd32_i2c->i2c_periph);
                }
                else
                {
                    /* configure slave address */
                    i2c_master_addressing_gd(gd32_i2c->i2c_periph, addr, I2C_MASTER_TRANSMIT_GD);
                    if(gd32_timeout_wait_flag(gd32_i2c->i2c_periph, I2C_FLAG_I2CBSY_GD, RT_FALSE, RT_NULL) != 0)
                    {
                        ret = -RT_ERROR;
                        break;
                    }
                    i2c_transfer_byte_number_config_gd(gd32_i2c->i2c_periph, w_total_byte);
                    /* send a start condition to I2C bus */
                    i2c_start_on_bus_gd(gd32_i2c->i2c_periph);
                }
#endif
            }
        }

        if(msg->flags & RT_I2C_RD)
        {
            if(gd32_i2c_read(gd32_i2c->i2c_periph, msg->buf, msg->len) != 0)
            {
                LOG_E("i2c bus read failed,i2c bus stop!");
                ret = -RT_ERROR;
                break;
            }
        }
        else
        {
            if(gd32_i2c_write(gd32_i2c->i2c_periph, msg->buf, msg->len) != 0)
            {
                LOG_E("i2c bus write failed,i2c bus stop!");
                ret = -RT_ERROR;
                break;
            }
        }

#ifdef GD32_I2C_HAS_NEW_IP
        if(!IS_I2C_LEGACY(gd32_i2c->i2c_periph))
        {
            if(r_total_byte != 0)
            {
                if(gd32_timeout_wait_flag(gd32_i2c->i2c_periph, I2C_FLAG_TC_GD, RT_TRUE, RT_NULL) != 0)
                {
                    ret = -RT_ERROR;
                    break;
                }
            }
        }
#endif
    }

    if((ret == RT_ERROR) && (i == num))
    {
        ret = i;
    }

#ifdef GD32_I2C_HAS_LEGACY_IP
    if(IS_I2C_LEGACY(gd32_i2c->i2c_periph))
    {
        if((msg != RT_NULL) && !(msg->flags & RT_I2C_NO_STOP))
        {
            if(msg->flags & RT_I2C_RD)
            {
                int wait_result = gd32_timeout_wait_flag(gd32_i2c->i2c_periph,
                                                         I2C_CTL0_STOP,
                                                         RT_FALSE,
                                                         RT_NULL);

                if(wait_result != RT_EOK)
                {
                    ret = wait_result;
                }
            }
            else
            {
                /* send a stop condition to I2C bus */
                i2c_stop_on_bus(gd32_i2c->i2c_periph);
                /* wait until stop condition generate */
                int wait_result = gd32_timeout_wait_flag(gd32_i2c->i2c_periph,
                                                         I2C_CTL0_STOP,
                                                         RT_FALSE,
                                                         RT_NULL);

                if(wait_result != RT_EOK)
                {
                    ret = wait_result;
                }
            }
        }
    }
    else
#endif
    {
#ifdef GD32_I2C_HAS_NEW_IP
        if((msg != RT_NULL) && !(msg->flags & RT_I2C_NO_STOP))
        {
            int wait_result = gd32_timeout_wait_flag(gd32_i2c->i2c_periph,
                                                     I2C_FLAG_TC_GD,
                                                     RT_TRUE,
                                                     RT_NULL);

